WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
/****************************************************************************
 * nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
 * 
 *   Copyright (C) 2024 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// This module, uses timers to calculate frequency

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <stdlib.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/arch.h>
#include <arch/board/board.h>
#include <sys/ioctl.h>
#include <nuttx/timers/timer.h>
#include "stm32_tim.h"
#include "stm32_gpio.h"
#include "stm32f777zit6-meadow.h"
#include "specialized/meadow_measure_freq_local.h"
#include <meadow/meadow_hw_version.h>
#include <meadow/hcom_shared_common.h>
#include <meadow/meadow_measure_freq_shared.h>

//=====================================================
// Diagnostic
// #define USE_MEADOW_DEBUG_HELPERS
#undef USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>
// #pragma message "(--) meadow_measure_freq.c"
// #pragma GCC optimize("O0")    // Prevent compiler from changing the code
#define MEADOW_MEASURE_FREQ_INCLUDE_REG_DUMP (0)
// Use pin for timing via scope
// #define DEBUG_PIN_V2_D06 (GPIO_OUTPUT | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN13)
// Diagnostic

/****************************************************************************
 * Private Data
 ****************************************************************************/
// This array contains timer information most of which is fixed by the
// STM32F7's hardware. It contains each F7 timer and a flag for useability
// (TIM1 and TIM8 are not usable). The 'Acv' (i.e. Active channels) byte
// contains 4 bits representing active/inuse channels within the timer.
static mdwFreqTimerInfo_t mdwFreqTimerInfoArray[] =
{
            //   |--- bit-field---|---------------------- Fixed by hardware -----------------------|--------- Runtime Data ---------|
            //   #  wid max apb use    Base Addr       Clk Timer Enable      IRQ Vector    Alt Func OvF Acv  Chan1 Chan2 Chan3 Chan4
  /* TIM1   */  {1 , 0,  1,  0, 0, STM32_TIM1_BASE,  0,                   0,               GPIO_AF1, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM2   */  {2 , 1,  0,  0, 1, STM32_TIM2_BASE,  RCC_APB1ENR_TIM2EN,  STM32_IRQ_TIM2,  GPIO_AF1, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM3   */  {3 , 0,  0,  0, 1, STM32_TIM3_BASE,  RCC_APB1ENR_TIM3EN,  STM32_IRQ_TIM3,  GPIO_AF2, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM4   */  {4 , 0,  0,  0, 1, STM32_TIM4_BASE,  RCC_APB1ENR_TIM4EN,  STM32_IRQ_TIM4,  GPIO_AF2, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM5   */  {5 , 1,  0,  0, 1, STM32_TIM5_BASE,  RCC_APB1ENR_TIM5EN,  STM32_IRQ_TIM5,  GPIO_AF2, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM8   */  {8 , 0,  1,  0, 0, STM32_TIM8_BASE,  0,                   0,               GPIO_AF3, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM9   */  {9 , 0,  1,  1, 1, STM32_TIM9_BASE,  RCC_APB2ENR_TIM9EN,  STM32_IRQ_TIM9,  GPIO_AF3, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM10  */  {10, 0,  1,  1, 1, STM32_TIM10_BASE, RCC_APB2ENR_TIM10EN, STM32_IRQ_TIM10, GPIO_AF3, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM11  */  {11, 0,  1,  1, 1, STM32_TIM11_BASE, RCC_APB2ENR_TIM11EN, STM32_IRQ_TIM11, GPIO_AF3, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM12  */  {12, 0,  0,  0, 1, STM32_TIM12_BASE, RCC_APB1ENR_TIM12EN, STM32_IRQ_TIM12, GPIO_AF9, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM13  */  {13, 0,  0,  0, 1, STM32_TIM13_BASE, RCC_APB1ENR_TIM13EN, STM32_IRQ_TIM13, GPIO_AF3, 0,  0, {NULL, NULL, NULL, NULL}},
  /* TIM14  */  {14, 0,  0,  0, 1, STM32_TIM14_BASE, RCC_APB1ENR_TIM14EN, STM32_IRQ_TIM14, GPIO_AF9, 0,  0, {NULL, NULL, NULL, NULL}}
};
#define MEADOW_FREQ_TOTAL_TIMERS_AVAILABLE (sizeof(mdwFreqTimerInfoArray)/sizeof(mdwFreqTimerInfo_t))

//----------------------------------------------------------------------------
// This table contains all of the STM32F7's timers and their valid GPIOs with
// channel. It is used for F7v1 and F7v2 and CCM. It should be able to verify
// any timer, GPIO combination.
mdwFreqChanPortPin_t validStm32F7GpioArray[][11] = 
{
  /* Tim 1 */
  {
    {GPIO_PORTA | GPIO_PIN8,  1},   // PA8
    {GPIO_PORTE | GPIO_PIN9,  1},   // PE9
    {GPIO_PORTA | GPIO_PIN9,  2},   // PA9
    {GPIO_PORTE | GPIO_PIN11, 2},   // PE11
    {GPIO_PORTA | GPIO_PIN10, 3},   // PA10
    {GPIO_PORTE | GPIO_PIN13, 3},   // PE13
    {GPIO_PORTA | GPIO_PIN11, 4},   // PA11
    {GPIO_PORTE | GPIO_PIN14, 4},   // PE14
    {0xff, 0}
  },

  /* Tim 2 */
  {
    {GPIO_PORTA | GPIO_PIN0,  1},   // PA0
    {GPIO_PORTA | GPIO_PIN15, 1},   // PA15
    {GPIO_PORTA | GPIO_PIN1,  2},   // PA1
    {GPIO_PORTB | GPIO_PIN3,  2},   // PB3
    {GPIO_PORTA | GPIO_PIN2,  3},   // PA2
    {GPIO_PORTB | GPIO_PIN10, 3},   // PB10
    {GPIO_PORTA | GPIO_PIN3,  4},   // PA3
    {GPIO_PORTB | GPIO_PIN11, 4},   // PB11
    {0xff, 0}
  },

  /* Tim 3 */
  {
    {GPIO_PORTA | GPIO_PIN6, 1},    // PA6
    {GPIO_PORTC | GPIO_PIN6, 1},    // PC6
    {GPIO_PORTB | GPIO_PIN4, 1},    // PB4
    {GPIO_PORTA | GPIO_PIN7, 2},    // PA7
    {GPIO_PORTC | GPIO_PIN7, 2},    // PC7
    {GPIO_PORTB | GPIO_PIN5, 2},    // PB5
    {GPIO_PORTB | GPIO_PIN0, 3},    // PB0
    {GPIO_PORTC | GPIO_PIN8, 3},    // PC8
    {GPIO_PORTB | GPIO_PIN1, 4},    // PB1
    {GPIO_PORTC | GPIO_PIN9, 4},    // PC9
    {0xff, 0}
  },
  
  /* Tim 4 */
  {
    {GPIO_PORTD | GPIO_PIN12, 1},    // PD12
    {GPIO_PORTB | GPIO_PIN6,  1},    // PB6
    {GPIO_PORTD | GPIO_PIN13, 2},    // PD13
    {GPIO_PORTB | GPIO_PIN7,  2},    // PB7
    {GPIO_PORTD | GPIO_PIN14, 3},    // PD14
    {GPIO_PORTB | GPIO_PIN8,  3},    // PB8
    {GPIO_PORTD | GPIO_PIN15, 4},    // PD15
    {GPIO_PORTB | GPIO_PIN9,  4},    // PB9
    {0xff, 0}
  },

  /* Tim 5 */
  {
    {GPIO_PORTA | GPIO_PIN0,  1},    // PA0
    {GPIO_PORTH | GPIO_PIN10, 1},    // PH10
    {GPIO_PORTA | GPIO_PIN1,  2},    // PA1
    {GPIO_PORTH | GPIO_PIN11, 2},    // PH11
    {GPIO_PORTA | GPIO_PIN2,  3},    // PA2
    {GPIO_PORTH | GPIO_PIN12, 3},    // PH12
    {GPIO_PORTA | GPIO_PIN3,  4},    // PA3
    {GPIO_PORTI | GPIO_PIN0,  4},    // PI0
    {0xff, 0}
  },

  /* Tim 6 No GPIOs */
    {{0xff, 0}},

  /* Tim 7 No GPIOs */
    {{0xff, 0}},

  /* Tim 8 */
  {
    {GPIO_PORTC | GPIO_PIN6, 1},    // PC6
    {GPIO_PORTI | GPIO_PIN5, 1},    // PI5
    {GPIO_PORTC | GPIO_PIN7, 2},    // PC7
    {GPIO_PORTI | GPIO_PIN6, 2},    // PI6
    {GPIO_PORTC | GPIO_PIN8, 3},    // PC8
    {GPIO_PORTI | GPIO_PIN7, 3},    // PI7
    {GPIO_PORTC | GPIO_PIN9, 4},    // PC9
    {GPIO_PORTI | GPIO_PIN2, 4},    // PI2
    {0xff, 0}
  },

  /* Tim 9 */
  {
    {GPIO_PORTE | GPIO_PIN5, 1},    // PE5
    {GPIO_PORTA | GPIO_PIN2, 1},    // PA2
    {GPIO_PORTE | GPIO_PIN6, 2},    // PE6
    {GPIO_PORTA | GPIO_PIN3, 2},    // PA3
    {0xff, 0}
  },

  /* Tim 10 */
  {
    {GPIO_PORTF | GPIO_PIN6, 1},    // PF6
    {GPIO_PORTB | GPIO_PIN8, 1},    // PB8
    {0xff, 0}
  },

  /* Tim 11 */
  {
    {GPIO_PORTF | GPIO_PIN7, 1},    // PF7
    {GPIO_PORTB | GPIO_PIN9, 1},    // PB9
    {0xff, 0}
  },

  /* Tim 12 */
  {
    {GPIO_PORTH | GPIO_PIN6,  1},    // PH6
    {GPIO_PORTB | GPIO_PIN14, 1},    // PB14
    {GPIO_PORTH | GPIO_PIN9,  2},    // PH9
    {GPIO_PORTB | GPIO_PIN15, 2},    // PB15
    {0xff, 0}
  },

