WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  /* Tim 13 */
  {
    {GPIO_PORTF | GPIO_PIN8, 1},    // PF8
    {GPIO_PORTA | GPIO_PIN6, 1},    // PA6
    {0xff, 0}
  },

  /* Tim 14 */
  {
    {GPIO_PORTF | GPIO_PIN9, 1},    // PF9
    {GPIO_PORTA | GPIO_PIN7, 1},    // PA7
    {0xff, 0}
  },
};

//-------------------------------------------------
// Used to verify port and pin availability on F7FeatherV1
static uint8_t validF7v1GpioArray[][5] =
{
  /* TIM1 No GPIO exposed */
  {0xff},
  /* TIM2  No GPIO exposed */
  {0xff},
  
  /* TIM3  */
  {GPIO_PORTC | GPIO_PIN6,  // PC6, D02
   GPIO_PORTC | GPIO_PIN7,  // PC7, D05
   GPIO_PORTB | GPIO_PIN0,  // PB0, D06
   GPIO_PORTB | GPIO_PIN1,  // PB1, D09 (or PC9, D11)
   0xff},

  /* TIM4 */
  {GPIO_PORTB | GPIO_PIN6,  // PB6, D08
   GPIO_PORTB | GPIO_PIN7,  // PB7, D07
   GPIO_PORTB | GPIO_PIN8,  // PB8, D03
   GPIO_PORTB | GPIO_PIN9,  // PB9, D04
   0xff},

  // /* TIM5 */
  {GPIO_PORTH | GPIO_PIN10,  // PH10, D10
   0xff},

  /* TIM6  No GPIO exposed */
  {0xff},
  /* TIM7  No GPIO exposed */
  {0xff},
  /* TIM8  No GPIO exposed */
  {0xff},

  /* TIM9  */
  {GPIO_PORTA | GPIO_PIN3,  // PA3, A02
   0xff},

  /* TIM10 */
  {GPIO_PORTB | GPIO_PIN8,  // PB8, D03
   0xff},

  /* TIM11 */
  {GPIO_PORTB | GPIO_PIN9,  // PB9, D04
   0xff},

  /* TIM12 */
  {GPIO_PORTB | GPIO_PIN14,  // PB14, D12
   GPIO_PORTB | GPIO_PIN15,  // PB15, D13
   0xff},

  /* TIM13  No GPIO exposed */
  {0xff},

  /* TIM14 */
  {GPIO_PORTA | GPIO_PIN7,  // PA7, A03
   0xff},
};

//-------------------------------------------------
// Used to verify port and pin availability on F7FeatherV2
static uint8_t validF7v2GpioArray[][5] =
{
  /* TIM1 No GPIO exposed */
  {0xff},

  /* TIM2 No GPIO exposed */
  {0xff},

  /* TIM3 */
  {GPIO_PORTB | GPIO_PIN4,  // PB4, D05
   GPIO_PORTC | GPIO_PIN7,  // PC7, D10
   GPIO_PORTB | GPIO_PIN0,  // PB0, A03
   GPIO_PORTB | GPIO_PIN1,  // PB1, A04
   0xff},

  /* TIM4 D08, D07, D03*, D04* */ {0x16,0x17,0x18,0x19,0xff},
  /* TIM4 */
  {GPIO_PORTB | GPIO_PIN8,  // PB6, D08
   GPIO_PORTB | GPIO_PIN7,  // PB7, D07
   GPIO_PORTB | GPIO_PIN8,  // PB8, D03
   GPIO_PORTB | GPIO_PIN9,  // PB9, D04
   0xff},

  /* TIM5 */
  {GPIO_PORTH | GPIO_PIN10,  // PH10, D02
   GPIO_PORTA | GPIO_PIN3,   // PA3, A02
   0xff},

  /* TIM6 No GPIO exposed */
  {0xff},
  /* TIM7 No GPIO exposed */
  {0xff},
  /* TIM8 No GPIO exposed */
  {0xff},
  /* TIM9 No GPIO exposed */
  {0xff},

  /* TIM10 */
  {GPIO_PORTB | GPIO_PIN8,  // PB8, D03
   0xff},

  /* TIM11 */
  {GPIO_PORTB | GPIO_PIN9,  // PB9, D04
   0xff},

  /* TIM12 */
  {GPIO_PORTB | GPIO_PIN14,  // PB14, D12
   GPIO_PORTB | GPIO_PIN15,  // PB15, D13
   0xff},

  /* TIM13 No GPIO exposed */
  {0xff},

  /* TIM14 No GPIO exposed */
  {0xff},
};

/************************************************************************************
 * Private Function Prototypes
 ************************************************************************************/

static int meadow_measure_freq_isr(int irq, void *context, void *arg);
static int meadow_measure_freq_unconfigure(mdwFreqCfgTimer_t *mdwCfgTimerChan);
static int meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo_t *mdwFreqTimerInfo);
static int meadow_measure_freq_cfg_channel_hardware(mdwFreqTimerInfo_t *mdwFreqTimerInfo,
          mdwFreqChanData_t *mdwFreqChanData);
#if MEADOW_MEASURE_FREQ_INCLUDE_REG_DUMP > 0
static void meadow_measure_freq_diag_dump_timer_regs(char *label,
            mdwFreqTimerInfo_t *mdwFreqTimerInfo);
#endif
/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// This ISR is called for all frequency measurement interrupts.
// There is a unique ISR vector for each timer. But, each timer must process
// 1 - 4 inputs. On entry we don't know which input(s) is/are involved.
int meadow_measure_freq_isr(int irq, void *context, void *arg)
{
  mdwFreqTimerInfo_t *mdwFreqTimerInfo = (mdwFreqTimerInfo_t *)arg;
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;

  // Get the current status to determine why ISR called
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  //----------------------------------------------------------
  // Check UIF (Update Interrupt Flag), which indicates CNT changed.
  if(timStatusReg & GTIM_SR_UIF)
  {
    timStatusReg &= ~GTIM_SR_UIF;

    // What we have is both 16/32-bit timer counts.The 16-bit timers rollover
    // multiple times per second. This is not good. Therefore, we use another
    // 32-bit uint for the overflow value. This approach effectively adds
    // 32-bits to each timer's size.
    //
    // Note: with a 96 MHz clock a 16-bit timer will rollover every 683
    // microseconds and at 960 kHz it will rollover every 68.3 milliseconds,
    // about 14.6 times/second.
    //
    // This overflow value is for the entire timer. It will be used in
    // conjunction with the captured values to calculate the frequency.
    mdwFreqTimerInfo->timerOverflow++;
  }

  // Any other interrupts to handle?
  if(timStatusReg == 0)
  {
    // No, exit
    putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
    return OK;
  }

  //----------------------------------------------------------
  // Get the channel data first to be used in common code
  // stm32_gpiowrite(DEBUG_PIN_V2_D06, true);    // Diagnostic only

  mdwFreqChanData_t *isrChanData[4];  // Pointer to channels data
  uint32_t           isrCapCounts[4]; // Current captured values

  // Memory off the stack is always dirty
  for(int chan = 0; chan < MEADOW_FREQ_MAX_TIMER_CHANNELS; chan++)
    isrChanData[chan] = NULL;

  if(timStatusReg & GTIM_SR_CC1IF)    // Channel 1
  {
    timStatusReg &= ~GTIM_SR_CC1IF;

    // Ignore interrupt if channel not configured
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_1)
    {
      isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_1] = 
              mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_1];
      if(isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_1] == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 1 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;  // No such device or address
      }

      isrCapCounts[FREQ_CHAN_DATA_OFFSET_CHAN_1] = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);
    }
  }
  
  if(timStatusReg & GTIM_SR_CC2IF)    // Channel 2
  {
    timStatusReg &= ~GTIM_SR_CC2IF;
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_2)
    {
      isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_2] = 
              mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_2];
      if(isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_2] == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 2 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;
      }

      isrCapCounts[FREQ_CHAN_DATA_OFFSET_CHAN_2] = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);
    }
  }

  if(timStatusReg & GTIM_SR_CC3IF)    // Channel 3
  {
    timStatusReg &= ~GTIM_SR_CC3IF;
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_3)
    {
      isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_3] = 
              mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_3];
      if(isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_3] == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 3 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;
      }

