WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
      isrCapCounts[FREQ_CHAN_DATA_OFFSET_CHAN_3] = getreg32(timerBase + STM32_GTIM_CCR3_OFFSET);
    }
  }
  
  if(timStatusReg & GTIM_SR_CC4IF)    // Channel 4
  {
    timStatusReg &= ~GTIM_SR_CC4IF;
    if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_4)
    {
      isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_4] = 
              mdwFreqTimerInfo->mdwFreqChanData[FREQ_CHAN_DATA_OFFSET_CHAN_4];
      if(isrChanData[FREQ_CHAN_DATA_OFFSET_CHAN_4] == NULL)
      {
        syslog(LOG_ERR, "%s@%d-Error:Channel 4 is NULL\n", __FILE__, __LINE__);
        return -ENXIO;
      }

      isrCapCounts[FREQ_CHAN_DATA_OFFSET_CHAN_4] = getreg32(timerBase + STM32_GTIM_CCR4_OFFSET);
    }
  }

  //----------------------------------------------------------
  // Channels 1 - 4
  for(int chan = 0; chan < MEADOW_FREQ_MAX_TIMER_CHANNELS; chan++)
  {
    mdwFreqChanData_t *mdwFreqChanData = isrChanData[chan];
    if(isrChanData[chan] == NULL)
    {
      continue;
    }

    //----------------------------------------------------------   
    if(mdwFreqChanData->useDutyCycle)
    {
      // With duty cycle we must read the GPIO's input state to determine
      // if this is raising or falling edge.
      if(stm32_gpioread(mdwFreqChanData->inputConfig))
      {
        // Raising edge with duty cycle
        // The end of the previous edge is now the beginning of this count.
        // These are captured so that when the calculations are executed
        // it is free to be unconcerned about changing values.
        mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
        mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
        mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
        mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

        // Capture end count and current overflow count
        mdwFreqChanData->endResultCnt = isrCapCounts[chan];
        mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

        // The following is for calculating average frequency
        mdwFreqChanData->gpioCountForAvg++;
      }
      else
      {
        // Duty cycle falling edge
        mdwFreqChanData->midCaptureCnt = isrCapCounts[chan];
        mdwFreqChanData->midCaptureOvr = mdwFreqTimerInfo->timerOverflow;
      }
    }
    else
    {
      // Not using duty cycle. Raising edge only. This is end of
      // previous capture and the beginning of a new capture.
      mdwFreqChanData->bgnResultCnt = mdwFreqChanData->endResultCnt;
      mdwFreqChanData->bgnResultOvr = mdwFreqChanData->endResultOvr;
      mdwFreqChanData->midResultCnt = mdwFreqChanData->midCaptureCnt;
      mdwFreqChanData->midResultOvr = mdwFreqChanData->midCaptureOvr;

      // End is now
      mdwFreqChanData->endResultCnt = isrCapCounts[chan];
      mdwFreqChanData->endResultOvr = mdwFreqTimerInfo->timerOverflow;

      // For calculating average frequency
      mdwFreqChanData->gpioCountForAvg++;
    }
  }

  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  // stm32_gpiowrite(DEBUG_PIN_V2_D06, false);    // Diagnostic only
  return OK;
}

//=============================================================
// Find the RCC clock for enable for the selected timer
static uint32_t meadow_measure_freq_get_apb_clock(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Timers use 2 different clock sources
static uint32_t meadow_measure_freq_get_max_clock(
          const mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  if(mdwFreqTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
// Disable the selected timer
static void meadow_measure_freq_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
// Enable the selected timer
static void meadow_measure_freq_enable(const uint32_t timerBase)
{
  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following returns the specified timer's information or NULL
static mdwFreqTimerInfo_t *meadow_measure_freq_chk_get_timer_info(
          const uint32_t timerNumb)
{
  mdwFreqTimerInfo_t *timerInfo = &(mdwFreqTimerInfoArray[timerNumb - 1]);
  if(timerInfo->timerUsable)
    return timerInfo;

  return NULL;
}

//=====================================================================
// Returns the correct bit field definition based on the timer's channel
static uint8_t meadow_measure_freq_get_channel_bit(const uint32_t timerChan)
{
  switch(timerChan)
  {
    case FREQ_CHANNEL_NUMBER_CHAN_1:
      return ACTIVE_CHAN_BITFIELD_1;

    case FREQ_CHANNEL_NUMBER_CHAN_2:
      return ACTIVE_CHAN_BITFIELD_2;

    case FREQ_CHANNEL_NUMBER_CHAN_3:
      return ACTIVE_CHAN_BITFIELD_3;

    case FREQ_CHANNEL_NUMBER_CHAN_4:
      return ACTIVE_CHAN_BITFIELD_4;

    default:
      return 0;
  }
}

//==================================================================
// Get the current time in nanoseconds. This is used for the average
// frequency calculations.
static uint64_t meadow_measure_freq_get_current_time(void)
{
  int ret;
  struct tm rtcTime;
  long nsecs;
  long prevNsecs;
  uint64_t returnTime;

  // This function reads the date, time and sub-seconds from the MCU's
  // hardware into a struct tm. However, the STM32F77X Errata warns about a
  // possible problem in ES0334-Rev 9 2.12.1 related to the RTC calendar
  // register not locked properly. Therefore, we'll implement the workaround
  // by reading the nsec twice and compare, if different repeat till equal.
#ifdef CONFIG_STM32F7_HAVE_RTC_SUBSECONDS
  do
  {
    ret = up_rtc_getdatetime_with_subseconds(&rtcTime, &prevNsecs);
    if(ret < 0)
    {
      return ret;
    }

    // Read a second time per Errata
    ret = up_rtc_getdatetime_with_subseconds(&rtcTime, &nsecs);
    if(ret < 0)
    {
      return ret;
    }

    // If they match we have good values
    if(prevNsecs == nsecs)
      break;
      
  } while (1);
#else
  // This function is used if no sub-seconds.
  ret = up_rtc_getdatetime(&rtcTime)
  nsecs = 0;
#endif

