WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  returnTime = mktime(&rtcTime);
  returnTime *= 1000 * 1000 * 1000;
  returnTime += nsecs;

  return returnTime;
}

//=============================================================
// This function will evaluate the GPIO based on 3 tables containing the
// valid GPIOs. For CCM only one table is checked. For F7v1 and F7v2
// The a version specific table is checked, and then the CCM table.
// Returns the channel, 1-4 unless not found, then returns 0.
static uint8_t meadow_measure_freq_get_chan_tim_port_pin(
          const uint32_t timerNumb, uint8_t portAndPin)
{
  int entry;
  int timerOffset = timerNumb - 1;

  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    // Verify port & pin are valid for FeatherV1 hardware
    entry = 0;
    while(validF7v1GpioArray[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validF7v1GpioArray[timerOffset][entry])
      {
        break;    // So far good
      }
      entry++;
    }

    if(validF7v1GpioArray[timerOffset][entry] == 0xff)
     return 0;
  }
  else if (meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2)
  {
    // Verify port & pin are valid for FeatherV2 hardware
    entry = 0;
    while(validF7v2GpioArray[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validF7v2GpioArray[timerOffset][entry])
      {
        break;    // So far good
      }
      entry++;
    }
    
    if(validF7v2GpioArray[timerOffset][entry] == 0xff)
      return 0;
  }
  else if (meadow_hw_version_get() != MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    // Unsupported device type
    syslog(1, "%s@%d- Unknown device type\n", __FILE__, __LINE__);
    return 0;
  }

  // All hardware types reach here to find the timer channel and verify the
  // port and pin are legal.
  entry = 0;
  while(validStm32F7GpioArray[timerOffset][entry].portPin != 0xff)
  {
    if(portAndPin == validStm32F7GpioArray[timerOffset][entry].portPin)
    {
      // Found valid channel
      return validStm32F7GpioArray[timerOffset][entry].chan;
    }
    entry++;
  }

  return 0; // Channel not found
}

/****************************************************************************
 * Public Function
 ****************************************************************************/
// Called by Meadow.Core to configure a timer channel
// Timer numbers range from 1 - 14. However, some are not defined.
int meadow_measure_freq_configure(mdwFreqCfgTimer_t *mdwCfgTimerChan)
{
  int ret;
  uint32_t timerNumber = mdwCfgTimerChan->timerNumber;
  uint32_t channelNumber = mdwCfgTimerChan->channelNumber;
  uint8_t portAndPin = (uint8_t)(mdwCfgTimerChan->portAndPin & 0x000000ff);
  uint32_t inputGpioConfig;
  uint32_t channelOffset = channelNumber - 1;
  bool timerNeedsConfig;
  bool chanNeedsDuty;

  if(timerNumber > 14 || timerNumber < 1)
  {
    syslog(LOG_ERR, "%s@%d-Error:Timer must be 1 - 14\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_TIM_NUMB_ILLEGAL;
  }
  
  if(channelNumber > 4 || channelNumber < 1)
  {
    syslog(LOG_ERR, "%s@%d-Error:Channel must be 1 - 4\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_CHAN_NUMB_ILLEGAL;
  }

  // stm32_configgpio(DEBUG_PIN_V2_D06);    // Diagnostic only

  // Configure the timer and channel
  // 1 = Configure without Duty Cycle (reduces interrupts by 50%)
  // 2 = Configure with Duty Cycle
  // 3 = Unconfigure timer
  // All others error
  switch(mdwCfgTimerChan->configOption)
  {
    case MEADOW_MEAS_FREQ_CONF_OPTION_NO_DC:
      chanNeedsDuty = false;
      break;

    case MEADOW_MEAS_FREQ_CONF_OPTION_WITH_DC:
      chanNeedsDuty = true;
      break;
     
    case MEADOW_MEAS_FREQ_CONF_OPTION_UNCFG:
      // Unconfigure - Also removes Timer if no channels remain
      ret = meadow_measure_freq_unconfigure(mdwCfgTimerChan);
      return ret;   // Done with unconfigure

    default:
      syslog(LOG_ERR, "%s@%d-Error:Unknown configure option:%llu\n",
                __FILE__, __LINE__, mdwCfgTimerChan->configOption);
      return MEADOW_MEAS_FREQ_CONF_UNDEFINED_OPTION;   // Function not implemented
  }

  // Insure a valid timer, channel, port+pin combination was supplied.
  // Timers have, at most, 4 channels, each representing 1 GPIO. For the
  // specified timer we need to verify a proper port and pin.
  uint8_t chanValid4TimerPortPin = meadow_measure_freq_get_chan_tim_port_pin(
            timerNumber, portAndPin);
  if(chanValid4TimerPortPin == 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:The Port and Pin, not valid for timer %d\n",
              __FILE__, __LINE__, timerNumber);
    return MEADOW_MEAS_FREQ_CONF_PORT_PIN_NOT_FOR_TIM;
  }

  // Is this the channel the user wanted?
  if(channelNumber != chanValid4TimerPortPin)
  {
    syslog(LOG_ERR, "%s@%d-Error:The Port/Pin/Timer/Channel combination, not valid\n",
              __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_PORT_PIN_TIM_CHAN_INVALID;
  }

  // Check if this timer is useable and get a pointer if it is
  mdwFreqTimerInfo_t *mdwFreqTimerInfo =
            meadow_measure_freq_chk_get_timer_info(timerNumber);
  if(mdwFreqTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Timer %ld unusable\n",
              __FILE__, __LINE__, timerNumber);
    return MEADOW_MEAS_FREQ_CONF_TIM_NOT_USABLE;
  }

#if MEADOW_MEASURE_FREQ_INCLUDE_REG_DUMP > 0
  meadow_measure_freq_diag_dump_timer_regs(
            "Before Configuration", mdwFreqTimerInfo);
#endif

  // Are any channels already active? If not, timer needs to be initialized
  if(mdwFreqTimerInfo->chanActiveBits == 0)
    timerNeedsConfig = true;
  else
    timerNeedsConfig = false;

  // This timer is usable, but is this channel already being used?
  uint8_t chanBit = meadow_measure_freq_get_channel_bit(channelNumber);
  if(mdwFreqTimerInfo->chanActiveBits & chanBit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Timer %d, channel %d already in use\n",
              __FILE__, __LINE__, timerNumber, channelNumber);
    return MEADOW_MEAS_FREQ_CONF_TIM_CHAN_IN_USE;
  }

  // Allocate a struct for each new channel on a timer
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset] =
            (mdwFreqChanData_t*)zalloc(sizeof(mdwFreqChanData_t));
  if(mdwFreqTimerInfo->mdwFreqChanData[channelOffset] == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Allocation for mdwFreqChanData_s\n", __FILE__, __LINE__);
    return MEADOW_MEAS_FREQ_CONF_CHAN_MEM_ALLOC_FAILED;
  }

