WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Start populating the channel structure
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->useDutyCycle = chanNeedsDuty;

  // Init time and count used to calculate average frequency
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->gpioCountForAvg = 0;
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->startTimeForAvg =
            meadow_measure_freq_get_current_time();

  // Indicate this channel is being used
  mdwFreqTimerInfo->chanActiveBits |= chanBit;    // Set channel bit

  // Build the GPIO input configuration for Nuttx GPIO processing
  inputGpioConfig = MEADOW_TIMER_GPIO_CONST | portAndPin | \
            mdwFreqTimerInfo->timerAltFunc;

  // // Diagnostic
  // syslog(1, "-->%s@%d-TIM%lu, Chn:%lu, input Pin defn:0x%02x (P%c%d), Pin defn+AF:0x%08lx\n",
  //           __FILE__, __LINE__, timerNumber, channelNumber, portAndPin,
  //           ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // // Diagnostic

  // Valided GPIO so, configure input for channel.
  ret = stm32_configgpio(inputGpioConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
    return MEADOW_MEAS_FREQ_CONF_CONFIGGPIO_ERR;   // Not supported
  }

  // Save GPIO configuration
  mdwFreqTimerInfo->mdwFreqChanData[channelOffset]->inputConfig = \
            inputGpioConfig;

  // Initialized the F7's channel hardware for this GPIO as input
  ret = meadow_measure_freq_cfg_channel_hardware(mdwFreqTimerInfo,
          mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:Channel hardware init failed:%d\n",
              __FILE__, __LINE__, ret);
    free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
    return MEADOW_MEAS_FREQ_CONF_INIT_CHAN_HW_FAIL;
  }

  // Initialized the F7's timer hardware
  if(timerNeedsConfig)
  {
    // Initialized the F7's timer hardware
    ret = meadow_measure_freq_cfg_timer_hardware(mdwFreqTimerInfo);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-Error:Timer hardware init failed:%d\n",
                __FILE__, __LINE__, ret);
      free(mdwFreqTimerInfo->mdwFreqChanData[channelOffset]);
      return MEADOW_MEAS_FREQ_CONF_INIT_TIM_HW_FAIL;
    }
  }
#if MEADOW_MEASURE_FREQ_INCLUDE_REG_DUMP > 0
  meadow_measure_freq_diag_dump_timer_regs(
          "After Configuration", mdwFreqTimerInfo);
#endif

  return MEADOW_MEAS_FREQ_CONF_SUCCESSFUL;
}

//============================================================
// Configuration of timer channel hardware registers.
int meadow_measure_freq_cfg_channel_hardware(
          mdwFreqTimerInfo_t *mdwFreqTimerInfo,
          mdwFreqChanData_t *mdwFreqChanData)
{
  uint32_t regVal32;
  uint16_t ccerRegVal;    // Capture/Compare Enable Register
  uint16_t dierRegVal;    // DMA/Interrupt Enable Register
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;
  bool useDC = mdwFreqChanData->useDutyCycle;

  ccerRegVal = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  dierRegVal = getreg16(timerBase + STM32_GTIM_DIER_OFFSET);
  
  // From STM32F7 Ref man: "Note: CC1S bits are writable only when the
  //    channel is OFF (CC1E = 0 in TIMx_CCER)."
  // We'll just set the entire CCER register to 0.
  putreg16((int)0, timerBase + STM32_GTIM_CCER_OFFSET);

  // Enable timer overrun (overflow)
  dierRegVal |= GTIM_DIER_UIE;

  // Enable the timer inputs for all active channels (all were disabled
  // earlier)
  if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_1)
  {
    // Capture/compare mode reg 1, chan 1
    regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
    regVal32 &= ~(GTIM_CCMR1_CC1S_MASK);
    regVal32 |= 0x00000001;       // 1 = 01, set bits 1:0
    putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

    // Set the input triggers, rising, falling or both for channel
    if(useDC)
      ccerRegVal |= (GTIM_CCER_CC1P | GTIM_CCER_CC1NP);   // 11 both edges
    else
      ccerRegVal &= ~(GTIM_CCER_CC1P | GTIM_CCER_CC1NP);  // 00 rising only
    ccerRegVal |= GTIM_CCER_CC1E;   // Enable capture channel 1
    dierRegVal |= GTIM_DIER_CC1IE;  // DMA/Interrupt enable
  }

  if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_2)
  {
    // Capture/compare mode reg 1, chan 2
    regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
    regVal32 &= ~(GTIM_CCMR1_CC2S_MASK);
    regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
    putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

    if(useDC)
      ccerRegVal |= (GTIM_CCER_CC2P | GTIM_CCER_CC2NP);   // 11 both edges
    else
      ccerRegVal &= ~(GTIM_CCER_CC2P | GTIM_CCER_CC2NP);  // 00 rising only
    ccerRegVal |= GTIM_CCER_CC2E;   // Enable capture channel 2
    dierRegVal |= GTIM_DIER_CC2IE;  // DMA/Interrupt enable
  }

  if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_3)
  {
    // Capture/compare mode reg 2, chan 3
    regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
    regVal32 &= ~(GTIM_CCMR2_CC3S_MASK);
    regVal32 |= 0x00000001;   // 1 = 01, set bits 1:0
    putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

    if(useDC)
      ccerRegVal |= (GTIM_CCER_CC3P | GTIM_CCER_CC3NP);   // 11 both edges
    else
      ccerRegVal &= ~(GTIM_CCER_CC3P | GTIM_CCER_CC3NP);  // 00 rising only
    ccerRegVal |= GTIM_CCER_CC3E;   // Enable capture channel 3
    dierRegVal |= GTIM_DIER_CC3IE;  // DMA/Interrupt enable
  }

  if(mdwFreqTimerInfo->chanActiveBits & ACTIVE_CHAN_BITFIELD_4)
  {
    // Capture/compare mode reg 2, chan 4
    regVal32 = getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET);
    regVal32 &= ~(GTIM_CCMR2_CC4S_MASK);
    regVal32 |= 0x00000100;   // 0x0100 = 0100, set bits 9:8
    putreg32(regVal32, timerBase + STM32_GTIM_CCMR2_OFFSET);

    if(useDC)
      ccerRegVal |= (GTIM_CCER_CC4P | GTIM_CCER_CC4NP);   // 11 both edges
    else
      ccerRegVal &= ~(GTIM_CCER_CC4P | GTIM_CCER_CC4NP);  // 00 rising only
    ccerRegVal |= GTIM_CCER_CC4E;   // Enable capture channel 4
    dierRegVal |= GTIM_DIER_CC4IE;  // DMA/Interrupt enable
  }

  // Clear all interrupt sources and then set the needed ones in the
  // DMA/Interrupt Enable Register.
  // Note: Unsupported Advanced timers 1 & 8 add ATIM_DIER_COMIE,
  // ATIM_DIER_BIE and ATIM_DIER_COMDE.
  modifyreg16(timerBase + STM32_GTIM_DIER_OFFSET,
          (GTIM_DIER_TDE   | GTIM_DIER_CC4DE | GTIM_DIER_CC3DE | GTIM_DIER_CC2DE |
           GTIM_DIER_CC1DE | GTIM_DIER_UDE   | GTIM_DIER_TIE   | GTIM_DIER_CC4IE |
           GTIM_DIER_CC3IE | GTIM_DIER_CC2IE | GTIM_DIER_CC1IE | GTIM_DIER_UIE),
          dierRegVal);

  // Capture/Compare Enable Register 
  putreg16(ccerRegVal, timerBase + STM32_GTIM_CCER_OFFSET);

  return OK;
}

