WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_measure_freq.c
  // Convert time in nanoseconds to fractional seconds
  double dblTotalCaptureTime =\
            ((double) totalCaptureTime) / (1000.0 * 1000.0 * 1000.0);
  dblTotalInputCount = (double)mdwFreqChanData->gpioCountForAvg;
  dblAvgFreq = ((double)dblTotalInputCount) / dblTotalCaptureTime;

  if(mdwFreqChanData->useDutyCycle)
    returnData->dutyCycleX1000  = (dblDutyCycle * 1000.0);
  else
    returnData->dutyCycleX1000  = 0;

  returnData->frequencyX1000    = (dblFrequency * 1000.0);
  returnData->avgFreqX1000      = (dblAvgFreq   * 1000.0);
  returnData->gpioCountForAvg   = (uint32_t)dblTotalInputCount;

  // Reset capture counts and Meadow time for next average
  mdwFreqChanData->gpioCountForAvg = 0;
  mdwFreqChanData->startTimeForAvg = meadow_measure_freq_get_current_time();

  return MEADOW_MEAS_FREQ_READ_SUCCESSFUL;
}

#if MEADOW_MEASURE_FREQ_INCLUDE_REG_DUMP > 0
//=================================================================
// Dump all timer registers
void meadow_measure_freq_diag_dump_timer_regs(char *label,
          mdwFreqTimerInfo_t *mdwFreqTimerInfo)
{
  uint32_t timerBase = mdwFreqTimerInfo->timerBase;

  syslog(1, "\nTimer:%lu Register Dump-%s\n", mdwFreqTimerInfo->timerNumb, label);
  syslog(1, "\tCR1:\t0x%08x\tCR2:\t0x%08x\tSMCR:\t0x%08x\tDIER:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_CR1_OFFSET),
          getreg16(timerBase + STM32_GTIM_CR2_OFFSET),
          getreg32(timerBase + STM32_GTIM_SMCR_OFFSET),
          getreg16(timerBase + STM32_GTIM_DIER_OFFSET));

  syslog(1, "\tSR:\t0x%08x\tEGR:\t0x%08x\tCCMR1:\t0x%08x\tCCMR2:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_SR_OFFSET),
          getreg16(timerBase + STM32_GTIM_EGR_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCMR2_OFFSET));

  syslog(1, "\tCCER:\t0x%08x\tCNT:\t0x%08x\tPSC:\t0x%08x\tARR:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_CCER_OFFSET),
          getreg32(timerBase + STM32_GTIM_CNT_OFFSET),
          getreg16(timerBase + STM32_GTIM_PSC_OFFSET),
          getreg32(timerBase + STM32_GTIM_ARR_OFFSET));

  syslog(1, "\tCCR1:\t0x%08x\tCCR2:\t0x%08x\tCCR3:\t0x%08x\tCCR4:\t0x%08x\n",
          getreg32(timerBase + STM32_GTIM_CCR1_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCR2_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCR3_OFFSET),
          getreg32(timerBase + STM32_GTIM_CCR4_OFFSET));

  syslog(1, "\tDCR:\t0x%08x\tDMAR:\t0x%08x\tOR:\t0x%08x\n",
          getreg16(timerBase + STM32_GTIM_DCR_OFFSET),
          getreg16(timerBase + STM32_GTIM_DMAR_OFFSET),
          getreg16(timerBase + STM32_GTIM_OR_OFFSET));
}
#endif
